![title](./pic/summary_functions/series/1_title.png)

In [1]:
import pandas as pd

In [6]:
df = pd.read_csv('./csv/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

<br>

Im letzten Notebook hast du gelernt, wie man relevante Daten aus einem `DataFrame` oder einer `Series` auswählt. Wie ich dir gezeigt habe, ist es entscheidend, die richtigen Daten aus der Datendarstellung herauszuziehen, um die Arbeit zu erledigen.

Allerdings kommen die Daten nicht immer in dem Format aus dem Speicher, in dem wir sie haben wollen. Manchmal müssen wir selbst etwas mehr Arbeit leisten, um sie für die anstehende Aufgabe umzuformatieren. In diesem Notebook werden verschiedene Operationen behandelt, die wir auf unsere Daten anwenden können, um einen ersten und schnellen Überblick über das vorliegende `DataFrame` zu erhalten.

Pandas bietet hierfür viele einfache **"Summary Functions"**, die die Daten in irgendeiner nützlichen Weise umstrukturieren und darstellen. 

In diesem Notebook betrachtet wir die Summary Functions, die dir Informationen über Series (also Spalten) in deinem  `DataFrame` liefern.

---

## `.mean()`

Um zum Beispiel den Mittelwert des Alters zu sehen, können wir die Funktion `.mean()` verwenden:

In [6]:
df.Age.mean()

30.272590361445783

---

## `.unique()`

Um eine Liste **einzigartiger Werte** anzuzeigen, können wir die Funktion `.unique()` verwenden:

In [7]:
df.Pclass.unique()

array([3, 2, 1])

---

## `.value_counts`

Um eine Liste der **eindeutigen Werte und deren Häufigkeit** im Datensatz anzuzeigen, kann die Methode `.value_counts()` verwendet werden:

In [8]:
df.Pclass.value_counts()

3    218
1    107
2     93
Name: Pclass, dtype: int64